package xyz.grumpyfurrybear.youplayiguess.constants;

import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

public interface Constants {
    int MATCH_TIME = 10; // 在线匹配时间，n秒内的玩家匹配在一起
    int DEFAULT_MAX_MATCH_USER_AMOUNT = 2;

    int ROOM_CACHE_TIME = 10; // 房间使用10分钟缓存

    int READY_PERFORM_COUNT_DOWN_TIME = 3; // 玩家上场的倒计时

    int USER_PERFORM_COUNT_DOWN_TIME = 60; // 每个玩家的表演时间

    int PERFORM_SCORE = 5; // 表演成功得5分
    int GUESS_SCORE = 10; //  猜词成功得10分


    String  WORD_STRING = "B超,CD,QQ,S型,一五一十,一刀两断,一分为二,一手遮天,一无所有,一瘸一拐,一见钟情,七上八下,七嘴八舌,丈母娘,三从四德,三国演义,三头六臂,三峡,三心二意,三长二短,上厕所雨伞,上海,下棋,下雨,下雪,不及格,不可开交,不差钱,世界杯,东倒西歪,东张西望,东施效颦,丝瓜,丢三落四,两肋插刀,两面三刀,中大奖,中暑,丰满,丹顶鹤,乌贼,乌鸦,乒乓球,九牛一毛,书包,争先恐后,五体投地,五音不全,亡羊补牢,交班,京剧,人民币,从容不迫,仓库,付款,企鹅,体检,作弊,你行你上呀,假惺惺,假牙,假货,做贼心虚,健身操,偷看美女,偷菜,儿童节,元宵节,元旦,兔死狐悲,拿破仑,公鸡,关羽,兴高采烈,兵马俑,军棋,冬瓜,冯巩,冰激凌,冰箱,冰糖葫芦,冷笑,减肥,凤姐,凳子,刘三姐,刘备,刘德华,刘欢,刘翔,刘若英,刮胡子,刮风,刺猬,剃头,剃须刀,前俯后仰,剪刀,剪指甲,劳动节,勺子,勺子电话,包饺子,化验,北极熊,北海,医院,升旗,卓别林,南宁,南瓜,南辕北辙,占座,压岁钱,叉烧,友谊关,双眼皮,发冷,发困,发夹,发薪水,变形金刚,口是心非,口红,可歌可泣,台灯,号啕大哭,吃田螺,吃西瓜,吃醋,吃面条,吊兰,同意,吓一跳,听诊器,吵架,吹口哨,吹牛皮,呆若木鸡,呕吐,周华健,周星驰,周杰伦,周润发,周瑜,呼吸困难,和尚,咖啡,咬牙切齿,咳嗽,咸菜,哈哈大笑,哈密瓜,哪吒,哭笑不得,哭闹,唉声叹气,唐伯虎,唐僧,唐山,唱歌,啤酒,喂鸡,喜出望外,喜洋洋,喝彩,喝水,喝酒,喷香水,嗑瓜子,嚎啕大哭,四脚朝天,回头是岸,回眸一笑,奥特曼,囧,围巾,拖拉机,围棋,围裙,国庆节,圆明园,圆规,土豆,坐井观天,垂头丧气,声东击西,夜宵,夜莺,大公无私,大兴安岭,大嘴巴,大庆,大惊小怪,大手大脚,大摇大摆,大明山,大款,大灰狼,大猩猩,大米,大肥猪,大腹便便,大舅子,大蒜,大观园,大象,天坑,天安门,天等,天鹅,太极,太阳,头痛,头破血流,夸夸其谈,奔驰,奖金,奥利给,奥特曼,奥迪,奶瓶,如鱼得水,妇女节,姗姗来迟,媒婆,嬉皮笑脸,孔雀,孕妇装,存折,孙子,孙悟空,孟非,守株待兔,宋丹丹,宋祖英,宝钗,宝马,害羞,宾阳,寒战,对不起,对牛弹琴,射击,垂头丧气,小偷,小兔子,小品,小沈阳,小狗,小白兔,小题大做,小鸡,少林寺,尖嘴猴腮,尼姑,尿不湿,山歌,山盟海誓,山羊,岳父,左右开弓,左顾右盼,巧克力,巩俐,巴马,布娃娃,布达拉宫,帅呆了,帽子,幸灾乐祸,幼儿园,床,床垫,庐山,废寝忘食,开会,开刀,开心果,开心网,开车,张冠李戴,张曼玉,张牙舞爪,张艺谋,张飞,彩票,微波炉,心心相印,心有灵犀一点通,心肺复苏,快乐大本营,快板,快餐,快马加鞭,怀孕,恍然大悟,恐龙,恶心,悄悄话,悬崖勒马,惊讶,愁眉苦脸,感冒,愤怒,成龙,我爸是李刚,戴口罩,手套,手忙脚乱,手机,手电筒,手舞足蹈,手表,打乒乓球,打印机,打喷嚏,打坐,打太极,打架,打气排球,打牌,发热,打电话,打篮球,打羽毛球,打草惊蛇,打雷,打麻将,扣子,扣工资,扫地,批评,抓耳挠腮,投篮,抛媚眼,抢劫,护士节,披萨,抱头鼠窜,抱歉,抹指甲油,抽烟,拍婚纱照,拍马屁,拔河,拔苗助长,拖地板,拖鞋,挂灯笼,指南针,指手划脚,指鹿为马,挤公交,挤眉弄眼,挥汗如雨,捡到钱,捣蛋,捧场,捧腹大笑,捶胸顿足,排球,接吻,掩耳盗铃,搞事情,摇头晃脑,摔倒,摔跤,摩托车,撒腿就跑,收音机,放屁,放虎归山,放风筝,故宫,教师节,斑马,斗地主,斜塔,斤斤计较,新生儿,新闻联播,方便面,旗袍,日光灯,计算器,日历,旷工,昂首挺胸,星星,春节,晒衣服,晕倒,晚会,晴天,暗恋,暴跳如雷,曹操,月亮,月饼,望子成龙,木瓜,木耳,杂技,李宁,李连杰,李逵,杨贵妃,杭州,杯子,林冲,林青霞,林黛玉,果子狸,柚子,柠檬精,柳州,核桃,桂林,桃子,桃花,梅花,梦游,梧州,梳头,梳子,棒打鸳鸯,棒棒糖,榨汁机,榴莲,樱桃小嘴,樱花,橙子,橡皮,橡皮擦,武则天,武术,武松,母乳喂养,母鸡,比翼双飞,比赛,毛巾,毛笔,水杯,门,水浒传,水牛,水立方,水龙头,汉堡包,汗流浃背,汤圆,汽水,沐浴露,沙和尚,没心没肺,河马,油条,法海,泥牛下海,泥鳅,注射器,泰山,洋洋得意,洋葱,洗头,洗手,洗碗,洗脸,洗衣服,洗衣机,洗衣粉,活印刷,流口水,流星,流氓,浇花,测体温,测血压,济公,海豚,海飞丝,海马,涂睫毛膏,消毒,淘宝网,温度计,游泳,漓江,激光,火山爆发,火柴,火锅,灭火器,灯笼,灰太狼,灰色,灵山,炒菜,炒饭,炮龙,点头哈腰,烟灰缸,烧饼,烫,照镜子,熊掌,熊猫,熨斗,燕子,燕窝,爱你一万年,牙刷,牙疼,牙膏,牛头马面,牛奶,牛魔王,牡丹花,犀利哥,狐狸,狗屁不通,狗急跳墙,狗熊,狡兔三窟,狮子,狸猫,狼吞虎咽,狼狈为奸,猩猩,猪八戒,猪脚,猫,猫头鹰,猴子,玉米,王八,王牌对王牌,玫瑰花,球拍,瓜子,瓷器,甘蔗,生姜,田东,田螺,电吹风,电梯,电灯泡,电烫斗,电脑,电视机,电话,电风扇,电饭锅,画地为牢,画蛇添足,画龙点睛,癞蛤蟆,白内障,白娘子,白斩狗,白日做梦,白糖,白色,白马,百合花,百度,百色,皮影,皮笑肉不笑,皮鞋,目中无人,目瞪口呆,盲人摸象,相声,眉开眼笑,眉来眼去,眉飞色舞,真香,眼红,眼镜,眼镜蛇,眼高手低,睡觉,石榴,研究生,破涕为笑,碗,牛仔裤,神气十足,秃顶,种菜,空气清新剂,空调,穿山甲,章鱼,端午节,竹笋,笨蛋,笨鸟先飞,筷子,篮球,粉笔,糯米饭,系鞋带,紫色,紫荆花,红光满面,红娘,红杏出墙,红楼梦,红色,红薯,红领巾,红颜,约会,纪晓岚,纸上谈兵,纽扣,结婚,绵羊,绿色,绿茶,网球,网购,美女,羽毛球,翻身,老公,老友粉,老婆,老师,老虎,老鹰,老鼠,老鼠过街,考试,耐克,耳环,耳目一新,肌肉注射,肚子痛,股票,胆小如鼠,胸怀宽大,胸无点墨,脸盆,腹泻,自行车,自言自语,臭美,臭虫,舞蹈,色狼,芋头,芒果,芙蓉姐姐,芝麻,芭蕾舞,花生油,苍蝇,苏州,苗条,苦瓜,苹果,茄子,茶叶,草莓,荔枝,荷包蛋,莫老爷,莲藕,菜刀,菠萝,萤火虫,葛洲坝,葡萄,葡萄酒,藏龙卧虎,藕断丝连,蘑菇,虎头蛇尾,虎背熊腰,虾,虾兵蟹将,蚂蚁,蚂蝗,蚊子,蛋糕,蜂蜜,蜈蚣,蜗牛,蜘蛛,蜜蜂,蜡烛,蜻蜓,蝌蚪,蝎子,蝗虫,蝴蝶,螃蟹,融水,螳螂,螺蛳粉,蟋蟀,蟑螂,蟒蛇,血盆大口,补考,表里如一,袋鼠,袜子,西山,西施,西游记,西湖,西瓜,西红柿,见钱眼开,认错,许仙,评剧,话剧,请假,诸葛亮,谈恋爱,谢谢,豆浆,豌豆,象棋,貂蝉,贼眉鼠眼,贾宝玉,走马观花,赵子龙,赵本山,赵飞燕,赶时髦,超市,超级女生,足球,跑步,跳棋,跳绳,跳舞,跳蚤,跳高,蹑手蹑脚,车票,辣,辣椒,连衣裙,连蹦带跳,迟到,造纸术,遛狗,邕江,郁金香,酒醉,酱油,酸,酸粉,酸菜鱼,醋,醋坛子,野猪,金钱豹,金鱼,金鸡独立,钳子,铁锤,铅笔,铲子,银滩,锄头,错误,镜子,镰刀,长吁短叹,长城,长江,长沙,长跑,长颈鹿,门当户对,门铃,闭目养神,闯红灯,闹钟,闻鸡起舞,阳朔,阿斗,阿迪达,陈佩斯,隐形眼镜,隐私,雨伞,雨衣,菜刀,雨鞋,雪上加霜,雪梨,雪莲,雷峰塔,震耳欲聋,青岛,青年节,青蛙,靠山吃山,靠水吃水,面条,面粉,韭菜,音响,韶山,顶天立地,项链,顺手牵羊,领奖金,颠三倒四,风筝,餐巾纸,饮水机,饺子,饼干,饿虎扑食,馄饨,馒头,香水,香皂,香肠,香蕉,马桶,马蜂,马铃薯,驴,骆驼,骑自行车,骑马,高跟鞋,高鼻梁,魔术,鲜花插在牛粪上,鲸鱼,鳄鱼,鸟巢,鸡犬不宁,鸡腿,鸡蛋,鸡飞狗跳,鸡鸣狗盗,鸭子,鸵鸟,山羊,鹌鹑蛋,鹦鹉,鹰钩鼻,鹿死谁手,麻子,麻雀,黄山,黄河,黄瓜,黄色,黄鼠狼,黄鼠狼给鸡拜年,黑哨,黑板刷,黑色,鼓掌,鼠目寸光,龙眼,龙腾虎跃";
    List<String> COMMON_WORDS = Arrays.stream(WORD_STRING.split(",")).collect(Collectors.toList());
}
